In [48]:
import pandas as pd
import numpy as np

In [51]:
df=pd.read_csv("prac_data.csv")
df

    Name     income
0    Rob       5000
1  Rafiq       6000
2   Nina       4000
3  Sofia       7500
4  Mohan       8000
5    Tao       7000
6   Elon  100000000

In [52]:
df.describe()

             income
count  7.000000e+00
mean   1.429107e+07
std    3.779409e+07
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+08

In [53]:
df.income.quantile(0.99)

94000479.99999996

In [54]:
df.income.quantile(0.5, interpolation="higher")

7000

In [55]:
df.income.quantile(0.99, interpolation="lower")

8000

### Want to discard anythign more than 99th percentile (REMOVE OUTLIER)

In [56]:
df_no_outlier=df[df.income<df.income.quantile(0.99)]
df_no_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [57]:
df

    Name     income
0    Rob       5000
1  Rafiq       6000
2   Nina       4000
3  Sofia       7500
4  Mohan       8000
5    Tao       7000
6   Elon  100000000

#### trying to make a value null

In [58]:
df['income'][3]=np.NaN

C:\Users\Neha Singh\AppData\Local\Temp\ipykernel_7296\3054271026.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.NaN
C:\Users\Neha Singh\AppData\Local\Temp\ipykernel_7296\3054271026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [59]:
df

    Name       income
0    Rob       5000.0
1  Rafiq       6000.0
2   Nina       4000.0
3  Sofia          NaN
4  Mohan       8000.0
5    Tao       7000.0
6   Elon  100000000.0

##### subsitute NaN with a value

In [60]:
df.income.mean()

16671666.666666666

In [61]:
df.income.median()

6500.0

In [62]:
df.fillna(df.income.median())

    Name       income
0    Rob       5000.0
1  Rafiq       6000.0
2   Nina       4000.0
3  Sofia       6500.0
4  Mohan       8000.0
5    Tao       7000.0
6   Elon  100000000.0